Информационная_база_5/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ВКМ_Подразделения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Информационная_база_5/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	

	ОтпускаСотрудников = ПолучитьИзВременногоХранилища(Адрес); 
	
	 Для каждого Элемент Из ОтпускаСотрудников Цикл
    
    	 Точка = АнализОтпусков.УстановитьТочку(Элемент.Имя); 
         Серия = АнализОтпусков.УстановитьСерию("Отпуск"); 
         ЗначениеДГ = АнализОтпусков.ПолучитьЗначение(Точка, Серия);  
               
         Интервал = ЗначениеДГ.Добавить(); 
         Интервал.Начало = Элемент.Начало; 
         Интервал.Конец = Элемент.Конец; 

	 КонецЦикла;   

КонецПроцедуры

&НаСервере
Функция ПолучитьПараметры()
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	ОтпускаСотрудниковДанные = Новый Массив; 
	
	Пока Выборка.Следующий() Цикл
		
		СотрудникСтруктура = Новый Структура;
		СотрудникСтруктура.Вставить("Имя",Выборка.Сотрудник);
		СотрудникСтруктура.Вставить("Начало" ,Выборка.ДатаНачала);
		СотрудникСтруктура.Вставить("Конец" , Выборка.ДатаОкончания);
		ОтпускаСотрудниковДанные.Добавить(СотрудникСтруктура); 
    КонецЦикла;
	
		
	Возврат ОтпускаСотрудниковДанные;

КонецФункции


#КонецОбласти
